print('Василів Богдан, ІС-01, завдання № 31')

a=float(input("Введіть число a:"))# ввід заданих дійсних чисел
b=float(input("Введіть число b:"))# ввід заданих дійсних чисел
c=float(input("Введіть число c:"))# ввід заданих дійсних чисел

if a==b or a==c or b==c:# перевірка умови
    print("Існує пара чисел рівних між собою") # вивід результату при виконанні умови

else: # якшо умова не виконується
    print("Не існує не одної пари рівних чисел") # вивід результату при не виконанні умови
